--[[
#
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
🃏🔺 dev🔰الكروب تحت🔰 ارسل لمعرفة مصنع البوت
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev : https://telegram.me/joinchat/B-5QgD-MTEjbNrWUgWF85w🔰☠
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev : @R1M18❤️
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev_bot : @R1M18_BOT❤
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev_Channel : @KING_BOT96❤️
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#
]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "م3" then
return [[
🔹 اوامر اضافية للمجموعات 🔹
☠❣❣вστ мsτя۩ĸσsнɪ❣❣☠
____________________________
/music + للبحث على اغنية : الاسم |🔍
/dl + لتحميلها : رقم الاغنية |🎵
/insta +معلومات الحساب : اليوزر |🎌
/weather +لمعرفة الطقس : المنطقة |⛈
/shortlink +اختصار الرابط : رابط |🔗
/azan +مواقيت الاذان : المنطقة |🕌
/tr +للترجمة : كلمات |📑
/time +لمعرفة الوقت : المنطقة |⏱
/sticker +تحويل صورة ملصق : بالرد |🚩
/image +: تحويل الملصق الى صورة 💡
/text +تحويل النص صورة : بالرد |🌈
/echo +البوت يكرر كلامك : كلمات |💬
/voice +تحويل النص صوت : كلمات |🔊
/tagall +اشارة لكل الاعضاء : كلمات |➕
/write + زخرفة اسماء : كلمات انكلش | ♨️
_____________________________
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
🃏🔺 dev🔰الكروب تحت🔰 ارسل لمعرفة مصنع البوت
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev : https://telegram.me/joinchat/B-5QgD-MTEjbNrWUgWF85w🔰☠
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev : @R1M18❤️
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev_bot : @R1M18_BOT❤
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
#Dev_Channel : @KING_BOT96❤️
🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖🔹➖🔸➖
]]
end

if not is_momod(msg) then
return "انته موادمن لاتعلب بكيفك 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(م3)"
},
run = run 
}
end
